src/pci.org
#+Title: PCI技术

* 错误处理
** ROB超时问题
ROB(re-order buffer, 重排序缓冲区)允许处理器指令乱序执行, 之后按照原有顺序提交. 目前
普遍使用[[https://en.wikipedia.org/wiki/Tomasulo_algorithm][Tomasulo算法]]. 
** 
** 
** 
**

* 资源链接
** ECN Internal Error Reporting
https://pcisig.com/sites/default/files/specification_documents/ECN_Internal-Error-Reporting_24Apr08.pdf

** ROB timeout debug guide
https://www.intel.com/content/dam/www/public/us/en/documents/white-papers/rob-timeout-debug-guide-paper.pdf
