pci.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-11-19 周日 11:58 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>PCI技术</title>
<meta name="generator" content="Org mode" />
<link rel="shortcut icon" href="http://ycode.org/css/favicon.ico" />
<link rel="stylesheet" type="text/css" href="css/site.css" />
</head>
<body>
<div id="content">
<h1 class="title">PCI技术</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgde7980a">1. 错误处理</a>
<ul>
<li><a href="#org448520e">1.1. ROB超时问题</a></li>
<li><a href="#org677c678">1.2. </a></li>
<li><a href="#orgbd675d3">1.3. </a></li>
<li><a href="#org80ea118">1.4. </a></li>
</ul>
</li>
<li><a href="#org4257dcd">2. 资源链接</a>
<ul>
<li><a href="#orgc27c7ee">2.1. ECN Internal Error Reporting</a></li>
<li><a href="#org0398a59">2.2. ROB timeout debug guide</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgde7980a" class="outline-2">
<h2 id="orgde7980a"><span class="section-number-2">1</span> 错误处理</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org448520e" class="outline-3">
<h3 id="org448520e"><span class="section-number-3">1.1</span> ROB超时问题</h3>
<div class="outline-text-3" id="text-1-1">
<p>
ROB(re-order buffer, 重排序缓冲区)允许处理器指令乱序执行, 之后按照原有顺序提交. 目前普遍使用<a href="https://en.wikipedia.org/wiki/Tomasulo_algorithm">Tomasulo算法</a>. 
</p>
</div>
</div>
<div id="outline-container-org677c678" class="outline-3">
<h3 id="org677c678"><span class="section-number-3">1.2</span> </h3>
</div>
<div id="outline-container-orgbd675d3" class="outline-3">
<h3 id="orgbd675d3"><span class="section-number-3">1.3</span> </h3>
</div>
<div id="outline-container-org80ea118" class="outline-3">
<h3 id="org80ea118"><span class="section-number-3">1.4</span> </h3>
<div class="outline-text-3" id="text-1-4">
<p>
**
</p>
</div>
</div>
</div>

<div id="outline-container-org4257dcd" class="outline-2">
<h2 id="org4257dcd"><span class="section-number-2">2</span> 资源链接</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgc27c7ee" class="outline-3">
<h3 id="orgc27c7ee"><span class="section-number-3">2.1</span> ECN Internal Error Reporting</h3>
<div class="outline-text-3" id="text-2-1">
<p>
<a href="https://pcisig.com/sites/default/files/specification_documents/ECN_Internal-Error-Reporting_24Apr08.pdf">https://pcisig.com/sites/default/files/specification_documents/ECN_Internal-Error-Reporting_24Apr08.pdf</a>
</p>
</div>
</div>

<div id="outline-container-org0398a59" class="outline-3">
<h3 id="org0398a59"><span class="section-number-3">2.2</span> ROB timeout debug guide</h3>
<div class="outline-text-3" id="text-2-2">
<p>
<a href="https://www.intel.com/content/dam/www/public/us/en/documents/white-papers/rob-timeout-debug-guide-paper.pdf">https://www.intel.com/content/dam/www/public/us/en/documents/white-papers/rob-timeout-debug-guide-paper.pdf</a>
</p>
</div>
</div>
</div>
</div>
</body>
</html>
